system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

needleRadius       0.75;   //mm  Needle is used to squeeze out the solder paste
nozzleRadius       0.036;  // nozzle inlet
exitRadius         0.052;  // nozzle outlet
bodyRadius         0.88;
holeRadius         0.09;

vertices
(
	// axis
	(0 0 1)
	(0 0 0)
	(0 0 -0.22001)
	(0 0 -0.54001)
	
	( 0.03596573597  -0.001570297945  1) //4   // r = 0.036  0.036*cos(2.5)=0.03596573597  0.036*sin(2.5)=0.001570297945 
	( 0.03596573597   0.001570297945  1)
	
	( 0.03596573597  -0.001570297945  0) //6  // r = 0.036  0.036*cos(2.5)=0.03596573597  0.036*sin(2.5)=0.001570297945 
	( 0.03596573597   0.001570297945  0)
	
	( 0.03596573597  -0.001570297945  -0.22001) //8  
	( 0.03596573597   0.001570297945  -0.22001)
	
	( 0.08991433994  -0.0039257448  -0.54001) //10   // r = 0.09  0.09*cos(2.5)=0.08991433994  0.09*sin(2.5)=0.0039257448
	( 0.08991433994   0.0039257448  -0.54001)
	
	( 0.4495716997  -0.0196287243  1) //12   // r = 0.45  0.45*cos(2.5)=0.4495716997, 0.45*sin(2.5)=0.0196287243
	( 0.4495716997   0.0196287243  1)
	
	( 0.4495716997  -0.0196287243  0) //14   // r = 0.45  0.45*cos(2.5)=0.4495716997, 0.45*sin(2.5)=0.0196287243
	( 0.4495716997   0.0196287243  0)
	
	( 0.74928616618  -0.032714540524  -0.25274570718) //16   // r = 0.75  0.75*cos(2.5)=0.74928616618, 0.75*sin(2.5)=0.032714540524
	( 0.74928616618   0.032714540524  -0.25274570718)
	
	( 0.74928616618  -0.032714540524  -0.57001) //18   // r = 0.75  0.75*cos(2.5)=0.74928616618, 0.75*sin(2.5)=0.032714540524
	( 0.74928616618   0.032714540524  -0.57001)
	
	( 0.879162434992  -0.03838506088  -0.25842162976) //20  // r = 0.88  0.88*cos(2.5)=0.879162434992, 0.88*sin(2.5)=0.03838506088
	( 0.879162434992   0.03838506088  -0.25842162976)
	
	( 0.879162434992  -0.03838506088  -0.57001) //22  // r = 0.88  0.88*cos(2.5)=0.879162434992, 0.88*sin(2.5)=0.03838506088
	( 0.879162434992   0.03838506088  -0.57001)
	
	( 0.74928616618  -0.032714540524  -1.75) //24   // r = 0.75  0.75*cos(2.5)=0.74928616618, 0.75*sin(2.5)=0.032714540524
	( 0.74928616618   0.032714540524  -1.75)
	
	( 0.879162434992  -0.03838506088  -1.75) //26  // r = 0.88  0.88*cos(2.5)=0.879162434992, 0.88*sin(2.5)=0.03838506088
	( 0.879162434992   0.03838506088  -1.75)
	
	( 0.74928616618  -0.032714540524  -5.01) //28   // r = 0.75  0.75*cos(2.5)=0.74928616618, 0.75*sin(2.5)=0.032714540524
	( 0.74928616618   0.032714540524  -5.01)
	
	( 0.879162434992  -0.03838506088  -5.01) //30  // r = 0.88  0.88*cos(2.5)=0.879162434992, 0.88*sin(2.5)=0.03838506088
	( 0.879162434992   0.03838506088  -5.01)
	
	( 1.498572332  -0.065429081  -1.75) //32  // r = 1.5  1.5*cos(2.5)=1.498572332, 1.5*sin(2.5)=0.065429081
	( 1.498572332   0.065429081  -1.75)
	
	( 1.498572332  -0.065429081  -5.01) //34  // r = 1.5  1.5*cos(2.5)=1.498572332, 1.5*sin(2.5)=0.065429081
	( 1.498572332   0.065429081  -5.01)
	
	
);

blocks
(
    hex (1 6 7 1 0 4 5 0) (6 1 48) simpleGrading (1 1 1)
	hex (6 14 15 7 4 12 13 5) (19 1 48) simpleGrading (3 1 1)
	
    hex (2 8 9 2 1 6 7 1) (6 1 8) simpleGrading (1 1 1)
	
    hex (3 10 11 3 2 8 9 2) (6 1 6) simpleGrading (1 1 0.32)
	hex (10 18 19 11 8 16 17 9) (10 1 6) simpleGrading (1 1 0.32)
	hex (18 22 23 19 16 20 21 17) (3 1 6) simpleGrading (1 1 0.32)
	hex (24 26 27 25 18 22 23 19) (3 1 7) simpleGrading (1 1 1)
	
	hex (28 30 31 29 24 26 27 25) (3 1 8) simpleGrading (1 1 1)
	hex (30 34 35 31 26 32 33 27) (3 1 8) simpleGrading (1 1 1)
);



edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 11 10 3)
			(10 11 19 18)
        );
    }
	pipe
    {
        type wall;
        faces
        (
            (6 8 9 7)
			(8 16 17 9)
			(16 20 21 17)
			(20 22 23 21)
			(22 26 27 23)
			(26 32 33 27)
			(32 34 35 33)
			(28 29 31 30)
        );
    }
    tank
    {
        type wall;
        faces
        (
            (0 4 5 0)
			(4 12 13 5)
        );
    }
	outlet 
	{
		type patch; 
		faces
		(
			(12 14 15 13)
			(6 7 15 14)
		);
	}
    axis
    {
        type empty;
        faces
        (
            (0 1 1 0)
            (1 2 2 1)
			(2 3 3 2)
        );
    }
	solderInlet
    {
        type patch;
        faces
        (
			(31 35 34 30)
		);
	}
    farField
    {
        type patch;
        faces
        (
            (18 19 25 24)
			(24 25 29 28)
        );
    }
    back
    {
        type wedge;
        faces
        (
            (7 1 0 5)
			(15 7 5 13)
            (9 2 1 7)
            (11 3 2 9)
			(19 11 9 17)
			(23 19 17 21)
			(27 25 19 23)
			(31 29 25 27)
			(35 31 27 33)
        );
    }
    front
    {
        type wedge;
        faces
        (
            (1 6 4 0)
			(4 6 14 12)
            (2 8 6 1)
            (3 10 8 2)
			(10 18 16 8)
			(18 22 20 16)
			(24 26 22 18)
			(28 30 26 24)
			(30 34 32 26)
		
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
